Царук Р. М. К-23
Білет № 1

1. 
Складність алгоритму - оцінка часу роботи алгоритму в залежності від кількості вхідних даних; 
характеристика, що відповідає на запитання, як зміниться час роботи (або кількість зайнятої програмою памяті - просторова складність), якщо збільшити кількість вхідних даних.
Складність алгоритму виражається з використанням нотації «O», яка у формулі залежності часу від кількості данних n враховує тільки доданок найвищого порядку, 
а також не враховує константні множники (коефіцієнти).

Найпоширеніші складності алгоритмів (від найшвидших до найповільніших):

O(1) — константний час. Знаходження елементу із заданим індексом в масиві (лінійний чи бінарний пошук), вставка і видалення у списках, основні команди хеш таблиць. 
O(log n) — логарифмічний. Знаходження елементу у відсортованому масиві. Операції з бінарними деревами та кучами.
O(n) — лінійний. Лінійний пошук (використовується у списках).
O(n*log n) — лінійно-логарифмічний. Середня складність багатьох алгоритмів сортування (швидке, злиттям).
O(n^2) — квадратичний. Бульбашкове сортування в найгіршому випадку.
O(2^n) — експотенціальний. Розграхунок чисел Фіббоначі.
O(n!) — факторіальний. Знаходження факториалу числа в рекурсії.


Зазвичай визначають складність алгоритму в найгіршому випадку або середню складність алгритму.
+ Амортизована складність - середня складність однієї виконання однієї операції для алгоримтів, які допускають додаткові незначні часові затрати, к-сть яких росте не швидше к-сті операцій.
